In [324]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as sts

1. Вывести информацию о наборе данных.

In [325]:
df = pd.read_csv("Исходные данные.csv", low_memory=False)
df.head(10)

,ID,Customer_ID,Month,Name,Age,SSN,Occupation,Annual_Income,Monthly_Inhand_Salary,Num_Bank_Accounts,...,Credit_Mix,Outstanding_Debt,Credit_Utilization_Ratio,Credit_History_Age,Payment_of_Min_Amount,Total_EMI_per_month,Amount_invested_monthly,Payment_Behaviour,Monthly_Balance,Credit_Score
0,0x1602,CUS_0xd40,January,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,_,809.98,26.822620,22 Years and 1 Months,No,49.574949,80.41529543900253,High_spent_Small_value_payments,312.49408867943663,Good
1,0x1603,CUS_0xd40,February,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.944960,NaN,No,49.574949,118.28022162236736,Low_spent_Large_value_payments,284.62916249607184,Good
2,0x1604,CUS_0xd40,March,Aaron Maashoh,-500,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,28.609352,22 Years and 3 Months,No,49.574949,81.699521264648,Low_spent_Medium_value_payments,331.2098628537912,Good
3,0x1605,CUS_0xd40,April,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,31.377862,22 Years and 4 Months,No,49.574949,199.4580743910713,Low_spent_Small_value_payments,223.45130972736786,Good
4,0x1606,CUS_0xd40,May,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,24.797347,22 Years and 5 Months,No,49.574949,41.420153086217326,High_spent_Medium_value_payments,341.48923103222177,Good
5,0x1607,CUS_0xd40,June,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,NaN,3,...,Good,809.98,27.262259,22 Years and 6 Months,No,49.574949,62.430172331195294,!@9#%8,340.4792117872438,Good
6,0x1608,CUS_0xd40,July,Aaron Maashoh,23,821-00-0265,Scientist,19114.12,1824.843333,3,...,Good,809.98,22.537593,22 Years and 7 Months,No,49.574949,178.3440674122349,Low_spent_Small_value_payments,244.5653167062043,Good
7,0x1609,CUS_0xd40,August,NaN,23,#F%$D@*&8,Scientist,19114.12,1824.843333,3,...,Good,809.98,23.933795,NaN,No,49.574949,24.785216509052056,High_spent_Medium_value_payments,358.12416760938714,Standard
8,0x160e,CUS_0x21b1,January,Rick Rothackerj,28_,004-07-5839,_______,34847.84,3037.986667,2,...,Good,605.03,24.464031,26 Years and 7 Months,No,18.816215,104.291825168246,Low_spent_Small_value_payments,470.69062692529184,Standard
9,0x160f,CUS_0x21b1,February,Rick Rothackerj,28,004-07-5839,Teacher,34847.84,3037.986667,2,...,Good,605.03,38.550848,26 Years and 8 Months,No,18.816215,40.39123782853101,High_spent_Large_value_payments,484.5912142650067,Good

In [326]:
df.dtypes

ID                           object
Customer_ID                  object
Month                        object
Name                         object
Age                          object
SSN                          object
Occupation                   object
Annual_Income                object
Monthly_Inhand_Salary       float64
Num_Bank_Accounts             int64
Num_Credit_Card               int64
Interest_Rate                 int64
Num_of_Loan                  object
Type_of_Loan                 object
Delay_from_due_date           int64
Num_of_Delayed_Payment       object
Changed_Credit_Limit         object
Num_Credit_Inquiries        float64
Credit_Mix                   object
Outstanding_Debt             object
Credit_Utilization_Ratio    float64
Credit_History_Age           object
Payment_of_Min_Amount        object
Total_EMI_per_month         float64
Amount_invested_monthly      object
Payment_Behaviour            object
Monthly_Balance              object
Credit_Score                 object
dtype: object

In [327]:
df.shape

(100000, 28)

2. Определить наличие ошибочных записей в признаках.
Исправить ошибочные записи, либо заменить ошибочные записи пропусками. Num_of_Loan

In [328]:
df[['Num_of_Loan']].loc[180:190]

    Num_of_Loan
180        -100
181           0
182           0
183           0
184        -100
185        -100
186           3
187           3
188           3
189           3
190           3

In [329]:
uniq = df["Num_of_Loan"].unique() # Поскольку Num_of_Loan: количество кредитов, взятых в банке оно должно быть >= 0 и не содержать _
uniq

array(['4', '1', '3', '967', '-100', '0', '0_', '2', '3_', '2_', '7', '5',
       '5_', '6', '8', '8_', '9', '9_', '4_', '7_', '1_', '1464', '6_',
       '622', '352', '472', '1017', '945', '146', '563', '341', '444',
       '720', '1485', '49', '737', '1106', '466', '728', '313', '843',
       '597_', '617', '119', '663', '640', '92_', '1019', '501', '1302',
       '39', '716', '848', '931', '1214', '186', '424', '1001', '1110',
       '1152', '457', '1433', '1187', '52', '1480', '1047', '1035',
       '1347_', '33', '193', '699', '329', '1451', '484', '132', '649',
       '995', '545', '684', '1135', '1094', '1204', '654', '58', '348',
       '614', '1363', '323', '1406', '1348', '430', '153', '1461', '905',
       '1312', '1424', '1154', '95', '1353', '1228', '819', '1006', '795',
       '359', '1209', '590', '696', '1185_', '1465', '911', '1181', '70',
       '816', '1369', '143', '1416', '455', '55', '1096', '1474', '420',
       '1131', '904', '89', '1259', '527', '1241', '449', '983', '418',
       '319', '23', '238', '638', '138', '235_', '280', '1070', '1484',
       '274', '494', '1459_', '404', '1354', '1495', '1391', '601',
       '1313', '1319', '898', '231', '752', '174', '961', '1046', '834',
       '284', '438', '288', '1463', '1151', '719', '198', '1015', '855',
       '841', '392', '1444', '103', '1320_', '745', '172', '252', '630_',
       '241', '31', '405', '1217', '1030', '1257', '137', '157', '164',
       '1088', '1236', '777', '1048', '613', '330', '1439', '321', '661',
       '952', '939', '562', '1202', '302', '943', '394', '955', '1318',
       '936', '781', '100', '1329', '1365', '860', '217', '191', '32',
       '282', '351', '1387', '757', '416', '833', '359_', '292', '1225_',
       '1227', '639', '859', '243', '267', '510', '332', '996', '597',
       '311', '492', '820', '336', '123', '540', '131_', '1311_', '1441',
       '895', '891', '50', '940', '935', '596', '29', '1182', '1129_',
       '1014', '251', '365', '291', '1447', '742', '1085', '148', '462',
       '832', '881', '1225', '1412', '785_', '1127', '910', '538', '999',
       '733', '101', '237', '87', '659', '633', '387', '447', '629',
       '831', '1384', '773', '621', '1419', '289', '143_', '285', '1393',
       '1131_', '27_', '1359', '1482', '1189', '1294', '201', '579',
       '814', '141', '1320', '581', '1171_', '295', '290', '433', '679',
       '1040', '1054', '1430', '1023', '1077', '1457', '1150', '701',
       '1382', '889', '437', '372', '1222', '126', '1159', '868', '19',
       '1297', '227_', '190', '809', '1216', '1074', '571', '520', '1274',
       '1340', '991', '316', '697', '926', '873', '1002', '378_', '65',
       '875', '867', '548', '652', '1372', '606', '1036', '1300', '17',
       '1178', '802', '1219_', '1271', '1137', '1496', '439', '196',
       '636', '192', '228', '1053', '229', '753', '1296', '1371', '254',
       '863', '464', '515', '838', '1160', '1289', '1298', '799', '182',
       '574', '527_', '242', '415', '869', '958', '54', '1265', '656',
       '275', '778', '208', '147', '350', '507', '463', '497', '1129',
       '927', '653', '662', '529', '635', '1027_', '897', '1039', '227',
       '1345', '924', '696_', '1279', '546', '1112', '1210', '526', '300',
       '1103', '504', '136', '1400', '78', '686', '1091', '344', '215',
       '84', '628', '1470', '968', '1478', '83', '1196', '1307', '1132_',
       '1008', '917', '657', '56', '18', '41', '801', '978', '216', '349',
       '966'], dtype=object)

In [330]:
zamena = dict()

for i in uniq:
    if '_' in i and i not in zamena:
        correct = i.replace('_', '')
        zamena[i] = correct
        
zamena

{'0_': '0',
 '3_': '3',
 '2_': '2',
 '5_': '5',
 '8_': '8',
 '9_': '9',
 '4_': '4',
 '7_': '7',
 '1_': '1',
 '6_': '6',
 '597_': '597',
 '92_': '92',
 '1347_': '1347',
 '1185_': '1185',
 '235_': '235',
 '1459_': '1459',
 '1320_': '1320',
 '630_': '630',
 '359_': '359',
 '1225_': '1225',
 '131_': '131',
 '1311_': '1311',
 '1129_': '1129',
 '785_': '785',
 '143_': '143',
 '1131_': '1131',
 '27_': '27',
 '1171_': '1171',
 '227_': '227',
 '378_': '378',
 '1219_': '1219',
 '527_': '527',
 '1027_': '1027',
 '696_': '696',
 '1132_': '1132'}

In [331]:
df = df.replace({"Num_of_Loan" : zamena})
df["Num_of_Loan"].unique()

array(['4', '1', '3', '967', '-100', '0', '2', '7', '5', '6', '8', '9',
       '1464', '622', '352', '472', '1017', '945', '146', '563', '341',
       '444', '720', '1485', '49', '737', '1106', '466', '728', '313',
       '843', '597', '617', '119', '663', '640', '92', '1019', '501',
       '1302', '39', '716', '848', '931', '1214', '186', '424', '1001',
       '1110', '1152', '457', '1433', '1187', '52', '1480', '1047',
       '1035', '1347', '33', '193', '699', '329', '1451', '484', '132',
       '649', '995', '545', '684', '1135', '1094', '1204', '654', '58',
       '348', '614', '1363', '323', '1406', '1348', '430', '153', '1461',
       '905', '1312', '1424', '1154', '95', '1353', '1228', '819', '1006',
       '795', '359', '1209', '590', '696', '1185', '1465', '911', '1181',
       '70', '816', '1369', '143', '1416', '455', '55', '1096', '1474',
       '420', '1131', '904', '89', '1259', '527', '1241', '449', '983',
       '418', '319', '23', '238', '638', '138', '235', '280', '1070',
       '1484', '274', '494', '1459', '404', '1354', '1495', '1391', '601',
       '1313', '1319', '898', '231', '752', '174', '961', '1046', '834',
       '284', '438', '288', '1463', '1151', '719', '198', '1015', '855',
       '841', '392', '1444', '103', '1320', '745', '172', '252', '630',
       '241', '31', '405', '1217', '1030', '1257', '137', '157', '164',
       '1088', '1236', '777', '1048', '613', '330', '1439', '321', '661',
       '952', '939', '562', '1202', '302', '943', '394', '955', '1318',
       '936', '781', '100', '1329', '1365', '860', '217', '191', '32',
       '282', '351', '1387', '757', '416', '833', '292', '1225', '1227',
       '639', '859', '243', '267', '510', '332', '996', '311', '492',
       '820', '336', '123', '540', '131', '1311', '1441', '895', '891',
       '50', '940', '935', '596', '29', '1182', '1129', '1014', '251',
       '365', '291', '1447', '742', '1085', '148', '462', '832', '881',
       '1412', '785', '1127', '910', '538', '999', '733', '101', '237',
       '87', '659', '633', '387', '447', '629', '831', '1384', '773',
       '621', '1419', '289', '285', '1393', '27', '1359', '1482', '1189',
       '1294', '201', '579', '814', '141', '581', '1171', '295', '290',
       '433', '679', '1040', '1054', '1430', '1023', '1077', '1457',
       '1150', '701', '1382', '889', '437', '372', '1222', '126', '1159',
       '868', '19', '1297', '227', '190', '809', '1216', '1074', '571',
       '520', '1274', '1340', '991', '316', '697', '926', '873', '1002',
       '378', '65', '875', '867', '548', '652', '1372', '606', '1036',
       '1300', '17', '1178', '802', '1219', '1271', '1137', '1496', '439',
       '196', '636', '192', '228', '1053', '229', '753', '1296', '1371',
       '254', '863', '464', '515', '838', '1160', '1289', '1298', '799',
       '182', '574', '242', '415', '869', '958', '54', '1265', '656',
       '275', '778', '208', '147', '350', '507', '463', '497', '927',
       '653', '662', '529', '635', '1027', '897', '1039', '1345', '924',
       '1279', '546', '1112', '1210', '526', '300', '1103', '504', '136',
       '1400', '78', '686', '1091', '344', '215', '84', '628', '1470',
       '968', '1478', '83', '1196', '1307', '1132', '1008', '917', '657',
       '56', '18', '41', '801', '978', '216', '349', '966'], dtype=object)

In [332]:
for i in df["Num_of_Loan"]:
    try:
        int(i)
    except:
        print("Ошибка c", i)
else:
    print("Ошибочных данных нет")

Ошибочных данных нет

In [333]:
df.loc[df['Num_of_Loan'] < '0'] = np.nan
df[['Num_of_Loan']].loc[180:190]

    Num_of_Loan
180         NaN
181           0
182           0
183           0
184         NaN
185         NaN
186           3
187           3
188           3
189           3
190           3

3. В соответствии с вариантом преобразовать признаки, которые должны быть количественными в числовой формат.

In [334]:
df["Num_of_Loan"].isna().sum()

3876

In [335]:
df["Num_of_Loan"] = pd.to_numeric(df["Num_of_Loan"], errors='coerce')
df["Num_of_Loan"].isna().sum()

3876

4. Для всех вариантов преобразовать признак "Credit_History_Age" в числовой формат (месяцы).

In [336]:
df[["Credit_History_Age"]].head(10)

      Credit_History_Age
0  22 Years and 1 Months
1                    NaN
2  22 Years and 3 Months
3  22 Years and 4 Months
4  22 Years and 5 Months
5  22 Years and 6 Months
6  22 Years and 7 Months
7                    NaN
8  26 Years and 7 Months
9  26 Years and 8 Months

In [337]:
cha = list(map(lambda x: int(x.split()[0]) * 12 + int(x.split()[3]) if x is not np.NaN else x, df["Credit_History_Age"].tolist()))
cha

[265,
 nan,
 267,
 268,
 269,
 270,
 271,
 nan,
 319,
 320,
 321,
 322,
 323,
 324,
 325,
 326,
 213,
 214,
 215,
 nan,
 217,
 218,
 219,
 220,
 207,
 208,
 209,
 210,
 211,
 212,
 213,
 nan,
 368,
 369,
 nan,
 371,
 372,
 373,
 374,
 nan,
 nan,
 384,
 nan,
 386,
 387,
 nan,
 389,
 390,
 367,
 368,
 369,
 370,
 371,
 nan,
 373,
 374,
 nan,
 176,
 177,
 178,
 179,
 nan,
 181,
 182,
 nan,
 257,
 258,
 259,
 260,
 261,
 262,
 263,
 nan,
 318,
 319,
 320,
 321,
 nan,
 nan,
 324,
 230,
 231,
 232,
 233,
 234,
 235,
 236,
 nan,
 305,
 306,
 307,
 308,
 309,
 310,
 311,
 312,
 322,
 323,
 324,
 325,
 326,
 327,
 328,
 329,
 107,
 108,
 109,
 110,
 111,
 112,
 nan,
 114,
 218,
 219,
 220,
 221,
 222,
 nan,
 224,
 225,
 202,
 203,
 204,
 205,
 206,
 207,
 nan,
 209,
 350,
 351,
 352,
 nan,
 354,
 nan,
 356,
 357,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 326,
 327,
 328,
 329,
 330,
 331,
 332,
 333,
 218,
 219,
 nan,
 221,
 nan,
 223,
 224,
 225,
 231,
 232,
 233,
 234,
 235,
 236,
 237,
 238,
 121,
 122,
 123,
 124,
 125,
 126,
 127,
 128,
 393,
 394,
 395,
 396,
 nan,
 nan,
 nan,
 400,
 nan,
 nan,
 149,
 150,
 151,
 152,
 nan,
 154,
 nan,
 147,
 148,
 149,
 150,
 151,
 152,
 153,
 214,
 215,
 nan,
 217,
 218,
 nan,
 nan,
 221,
 164,
 nan,
 nan,
 nan,
 168,
 169,
 170,
 171,
 230,
 231,
 232,
 233,
 234,
 235,
 236,
 nan,
 363,
 364,
 365,
 366,
 367,
 368,
 nan,
 370,
 nan,
 105,
 106,
 nan,
 108,
 109,
 nan,
 111,
 219,
 220,
 221,
 222,
 223,
 224,
 225,
 nan,
 225,
 226,
 227,
 228,
 229,
 230,
 231,
 232,
 104,
 105,
 106,
 107,
 108,
 109,
 110,
 111,
 157,
 158,
 159,
 nan,
 161,
 162,
 163,
 164,
 257,
 258,
 259,
 260,
 261,
 262,
 nan,
 264,
 307,
 308,
 309,
 310,
 311,
 312,
 313,
 314,
 nan,
 159,
 nan,
 161,
 162,
 163,
 164,
 165,
 335,
 336,
 337,
 338,
 339,
 nan,
 341,
 342,
 94,
 95,
 96,
 97,
 98,
 99,
 100,
 101,
 291,
 292,
 293,
 294,
 295,
 296,
 297,
 nan,
 205,
 206,
 207,
 208,
 209,
 210,
 211,
 nan,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 nan,
 131,
 132,
 133,
 134,
 135,
 136,
 137,
 138,
 367,
 nan,
 369,
 370,
 371,
 372,
 373,
 374,
 235,
 236,
 237,
 nan,
 nan,
 240,
 241,
 nan,
 nan,
 126,
 127,
 nan,
 129,
 130,
 nan,
 132,
 167,
 168,
 169,
 170,
 171,
 172,
 173,
 174,
 248,
 249,
 250,
 251,
 252,
 253,
 254,
 255,
 4,
 5,
 6,
 nan,
 8,
 9,
 10,
 nan,
 nan,
 380,
 381,
 382,
 383,
 384,
 385,
 386,
 202,
 203,
 204,
 205,
 206,
 207,
 208,
 209,
 149,
 150,
 151,
 152,
 153,
 154,
 155,
 nan,
 151,
 152,
 153,
 154,
 nan,
 156,
 157,
 158,
 327,
 328,
 329,
 nan,
 331,
 332,
 333,
 334,
 136,
 137,
 138,
 139,
 140,
 141,
 142,
 nan,
 nan,
 297,
 298,
 299,
 300,
 301,
 302,
 303,
 211,
 nan,
 213,
 214,
 215,
 216,
 217,
 218,
 152,
 153,
 154,
 nan,
 156,
 nan,
 158,
 nan,
 121,
 122,
 123,
 124,
 125,
 126,
 127,
 128,
 229,
 230,
 231,
 232,
 233,
 234,
 235,
 nan,
 122,
 123,
 nan,
 125,
 126,
 127,
 128,
 129,
 373,
 374,
 375,
 376,
 377,
 378,
 379,
 380,
 nan,
 369,
 370,
 371,
 372,
 373,
 nan,
 375,
 205,
 206,
 207,
 208,
 209,
 210,
 211,
 212,
 158,
 159,
 nan,
 161,
 162,
 nan,
 164,
 165,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 157,
 158,
 159,
 160,
 161,
 162,
 163,
 164,
 291,
 292,
 293,
 294,
 295,
 296,
 297,
 nan,
 196,
 197,
 198,
 199,
 200,
 201,
 202,
 203,
 275,
 276,
 nan,
 278,
 279,
 280,
 281,
 282,
 100,
 101,
 102,
 103,
 104,
 nan,
 106,
 107,
 369,
 370,
 371,
 372,
 373,
 374,
 375,
 376,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 392,
 393,
 394,
 395,
 396,
 397,
 398,
 399,
 146,
 147,
 nan,
 149,
 150,
 151,
 152,
 153,
 383,
 384,
 385,
 386,
 387,
 388,
 389,
 390,
 319,
 320,
 321,
 nan,
 323,
 nan,
 325,
 nan,
 nan,
 207,
 208,
 209,
 210,
 211,
 212,
 213,
 155,
 156,
 157,
 158,
 nan,
 160,
 161,
 162,
 357,
 nan,
 359,
 360,
 nan,
 362,
 363,
 364,
 307,
 308,
 309,
 310,
 311,
 312,
 313,
 314,
 394,
 395,
 396,
 397,
 398,
 399,
 400,
 nan,
 314,
 315,
 316,
 317,
 318,
 319,
 320,
 321,
 213,
 214,
 215,
 216,
 217,
 218,
 219,
 220,
 nan,
 90,
 91,
 92,
 93,
 94,
 nan,
 96,
 134,
 135,
 136,
 137,
 138,
 139,
 140,
 141,
 339,
 340,
 341,
 342,
 343,
 344,
 345,
 346,
 350,
 351,
 352,
 353,
 354,
 355,
 356,
 357,
 nan,
 228,
 229,
 230,
 231,
 232,
 233,
 234,
 239,
 240,
 241,
 242,
 243,
 244,
 245,
 246,
 nan,
 242,
 243,
 244,
 245,
 246,
 247,
 248,
 364,
 nan,
 366,
 367,
 368,
 369,
 nan,
 371,
 343,
 nan,
 345,
 346,
 347,
 348,
 nan,
 350,
 nan,
 161,
 162,
 163,
 nan,
 165,
 166,
 167,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 397,
 398,
 399,
 nan,
 401,
 402,
 403,
 404,
 309,
 nan,
 nan,
 312,
 313,
 314,
 315,
 316,
 345,
 346,
 nan,
 348,
 349,
 nan,
 351,
 352,
 57,
 nan,
 59,
 60,
 61,
 62,
 63,
 64,
 379,
 nan,
 381,
 382,
 383,
 384,
 385,
 386,
 392,
 nan,
 394,
 395,
 396,
 397,
 398,
 399,
 105,
 106,
 107,
 108,
 109,
 110,
 111,
 nan,
 291,
 292,
 293,
 294,
 295,
 296,
 297,
 298,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 nan,
 nan,
 232,
 233,
 234,
 235,
 236,
 237,
 238,
 268,
 269,
 270,
 271,
 nan,
 273,
 274,
 275,
 196,
 197,
 198,
 nan,
 200,
 nan,
 202,
 203,
 273,
 274,
 275,
 nan,
 277,
 278,
 279,
 nan,
 259,
 nan,
 261,
 262,
 263,
 264,
 nan,
 266,
 259,
 260,
 nan,
 262,
 263,
 264,
 265,
 266,
 242,
 243,
 244,
 nan,
 246,
 247,
 248,
 249,
 nan,
 338,
 339,
 340,
 341,
 342,
 343,
 344,
 146,
 nan,
 nan,
 nan,
 150,
 151,
 152,
 nan,
 184,
 185,
 186,
 187,
 188,
 189,
 190,
 191,
 243,
 244,
 245,
 246,
 247,
 248,
 249,
 nan,
 149,
 150,
 151,
 152,
 153,
 154,
 155,
 156,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 58,
 nan,
 60,
 61,
 62,
 63,
 nan,
 65,
 317,
 nan,
 319,
 320,
 321,
 322,
 323,
 324,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 184,
 185,
 nan,
 187,
 188,
 189,
 190,
 191,
 194,
 195,
 196,
 197,
 198,
 199,
 200,
 nan,
 265,
 nan,
 nan,
 268,
 269,
 270,
 271,
 272,
 369,
 370,
 371,
 372,
 373,
 374,
 375,
 376,
 ...]

In [338]:
df["Credit_History_Age"] = cha
df[["Credit_History_Age"]].head(10)

   Credit_History_Age
0               265.0
1                 NaN
2               267.0
3               268.0
4               269.0
5               270.0
6               271.0
7                 NaN
8               319.0
9               320.0

5. Определить наличие аномальных значений, которые не соответствуют физической природе признаков. Заменить аномальные значения пропусками.

In [339]:
df[["Age"]].head(10)

    Age
0    23
1    23
2  -500
3    23
4    23
5    23
6    23
7    23
8   28_
9    28

In [340]:
ages = df["Age"].unique()
ages

array(['23', '-500', '28_', ..., '4808_', '2263', '1342'], dtype=object)

In [341]:
z = dict()

for age in ages:
    if age is not np.nan and '_' in age:
        correct = age.replace('_', '')
        z[age] = correct

z

{'28_': '28',
 '34_': '34',
 '30_': '30',
 '24_': '24',
 '33_': '33',
 '35_': '35',
 '40_': '40',
 '37_': '37',
 '54_': '54',
 '21_': '21',
 '20_': '20',
 '43_': '43',
 '38_': '38',
 '18_': '18',
 '2111_': '2111',
 '46_': '46',
 '16_': '16',
 '19_': '19',
 '47_': '47',
 '53_': '53',
 '25_': '25',
 '27_': '27',
 '55_': '55',
 '42_': '42',
 '48_': '48',
 '49_': '49',
 '50_': '50',
 '32_': '32',
 '22_': '22',
 '17_': '17',
 '29_': '29',
 '15_': '15',
 '51_': '51',
 '31_': '31',
 '26_': '26',
 '39_': '39',
 '14_': '14',
 '36_': '36',
 '44_': '44',
 '7670_': '7670',
 '45_': '45',
 '23_': '23',
 '41_': '41',
 '52_': '52',
 '733_': '733',
 '5769_': '5769',
 '4383_': '4383',
 '56_': '56',
 '2650_': '2650',
 '3307_': '3307',
 '6962_': '6962',
 '5589_': '5589',
 '6556_': '6556',
 '1447_': '1447',
 '8153_': '8153',
 '3834_': '3834',
 '6744_': '6744',
 '6471_': '6471',
 '7723_': '7723',
 '6408_': '6408',
 '3502_': '3502',
 '7316_': '7316',
 '1102_': '1102',
 '8669_': '8669',
 '2463_': '2463',
 '3055_': '3055',
 '1248_': '1248',
 '2220_': '2220',
 '2159_': '2159',
 '4583_': '4583',
 '3988_': '3988',
 '2155_': '2155',
 '6770_': '6770',
 '1843_': '1843',
 '3742_': '3742',
 '2171_': '2171',
 '5109_': '5109',
 '3984_': '3984',
 '2474_': '2474',
 '5046_': '5046',
 '7715_': '7715',
 '2329_': '2329',
 '707_': '707',
 '844_': '844',
 '2756_': '2756',
 '2037_': '2037',
 '902_': '902',
 '8523_': '8523',
 '3640_': '3640',
 '3998_': '3998',
 '2097_': '2097',
 '8348_': '8348',
 '5373_': '5373',
 '3291_': '3291',
 '2994_': '2994',
 '3339_': '3339',
 '2812_': '2812',
 '3578_': '3578',
 '3564_': '3564',
 '1794_': '1794',
 '737_': '737',
 '4301_': '4301',
 '2846_': '2846',
 '2373_': '2373',
 '1188_': '1188',
 '8207_': '8207',
 '6381_': '6381',
 '8616_': '8616',
 '6799_': '6799',
 '1591_': '1591',
 '3775_': '3775',
 '6564_': '6564',
 '7122_': '7122',
 '4913_': '4913',
 '5697_': '5697',
 '4445_': '4445',
 '780_': '780',
 '1070_': '1070',
 '5798_': '5798',
 '4808_': '4808'}

In [342]:
df = df.replace({'Age' : z})
df[['Age']]

        Age
0        23
1        23
2      -500
3        23
4        23
...     ...
99995    25
99996    25
99997    25
99998    25
99999    25

[100000 rows x 1 columns]

In [343]:
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')
df['Age']

0         23.0
1         23.0
2       -500.0
3         23.0
4         23.0
         ...
99995     25.0
99996     25.0
99997     25.0
99998     25.0
99999     25.0
Name: Age, Length: 100000, dtype: float64

In [344]:
df[(df['Age'] < 18) | (df['Age'] > 115)].shape

(8174, 28)

В датасете 8174 строк где возраст < 18 (Нельзя оформить кредитную карту) или > 115 (Люди столько не живут (Больше рекорда долголетия))

In [349]:
df.loc[(df['Age'] < 18) | (df['Age'] > 115), 'Age'] = np.nan
df[['Age']].head(10)

    Age
0  23.0
1  23.0
2   NaN
3  23.0
4  23.0
5  23.0
6  23.0
7  23.0
8  28.0
9  28.0

In [350]:
df[['Num_of_Loan', 'Type_of_Loan', 'Monthly_Balance']].isna().sum()

Num_of_Loan         3876
Type_of_Loan       14867
Monthly_Balance     5034
dtype: int64

In [351]:
NoL, ToL, MB = df['Num_of_Loan'], df['Type_of_Loan'], df['Monthly_Balance']

In [355]:
NoL_uniq, NoL_freq = np.unique(NoL, return_counts = True)
print(NoL_uniq)
print(NoL_freq)

[0.000e+00 1.000e+00 2.000e+00 3.000e+00 4.000e+00 5.000e+00 6.000e+00
 7.000e+00 8.000e+00 9.000e+00 1.700e+01 1.800e+01 1.900e+01 2.300e+01
 2.700e+01 2.900e+01 3.100e+01 3.200e+01 3.300e+01 3.900e+01 4.100e+01
 4.900e+01 5.000e+01 5.200e+01 5.400e+01 5.500e+01 5.600e+01 5.800e+01
 6.500e+01 7.000e+01 7.800e+01 8.300e+01 8.400e+01 8.700e+01 8.900e+01
 9.200e+01 9.500e+01 1.000e+02 1.010e+02 1.030e+02 1.190e+02 1.230e+02
 1.260e+02 1.310e+02 1.320e+02 1.360e+02 1.370e+02 1.380e+02 1.410e+02
 1.430e+02 1.460e+02 1.470e+02 1.480e+02 1.530e+02 1.570e+02 1.640e+02
 1.720e+02 1.740e+02 1.820e+02 1.860e+02 1.900e+02 1.910e+02 1.920e+02
 1.930e+02 1.960e+02 1.980e+02 2.010e+02 2.080e+02 2.150e+02 2.160e+02
 2.170e+02 2.270e+02 2.280e+02 2.290e+02 2.310e+02 2.350e+02 2.370e+02
 2.380e+02 2.410e+02 2.420e+02 2.430e+02 2.510e+02 2.520e+02 2.540e+02
 2.670e+02 2.740e+02 2.750e+02 2.800e+02 2.820e+02 2.840e+02 2.850e+02
 2.880e+02 2.890e+02 2.900e+02 2.910e+02 2.920e+02 2.950e+02 3.000e+02
 3.020e+02 3.110e+02 3.130e+02 3.160e+02 3.190e+02 3.210e+02 3.230e+02
 3.290e+02 3.300e+02 3.320e+02 3.360e+02 3.410e+02 3.440e+02 3.480e+02
 3.490e+02 3.500e+02 3.510e+02 3.520e+02 3.590e+02 3.650e+02 3.720e+02
 3.780e+02 3.870e+02 3.920e+02 3.940e+02 4.040e+02 4.050e+02 4.150e+02
 4.160e+02 4.180e+02 4.200e+02 4.240e+02 4.300e+02 4.330e+02 4.370e+02
 4.380e+02 4.390e+02 4.440e+02 4.470e+02 4.490e+02 4.550e+02 4.570e+02
 4.620e+02 4.630e+02 4.640e+02 4.660e+02 4.720e+02 4.840e+02 4.920e+02
 4.940e+02 4.970e+02 5.010e+02 5.040e+02 5.070e+02 5.100e+02 5.150e+02
 5.200e+02 5.260e+02 5.270e+02 5.290e+02 5.380e+02 5.400e+02 5.450e+02
 5.460e+02 5.480e+02 5.620e+02 5.630e+02 5.710e+02 5.740e+02 5.790e+02
 5.810e+02 5.900e+02 5.960e+02 5.970e+02 6.010e+02 6.060e+02 6.130e+02
 6.140e+02 6.170e+02 6.210e+02 6.220e+02 6.280e+02 6.290e+02 6.300e+02
 6.330e+02 6.350e+02 6.360e+02 6.380e+02 6.390e+02 6.400e+02 6.490e+02
 6.520e+02 6.530e+02 6.540e+02 6.560e+02 6.570e+02 6.590e+02 6.610e+02
 6.620e+02 6.630e+02 6.790e+02 6.840e+02 6.860e+02 6.960e+02 6.970e+02
 6.990e+02 7.010e+02 7.160e+02 7.190e+02 7.200e+02 7.280e+02 7.330e+02
 7.370e+02 7.420e+02 7.450e+02 7.520e+02 7.530e+02 7.570e+02 7.730e+02
 7.770e+02 7.780e+02 7.810e+02 7.850e+02 7.950e+02 7.990e+02 8.010e+02
 8.020e+02 8.090e+02 8.140e+02 8.160e+02 8.190e+02 8.200e+02 8.310e+02
 8.320e+02 8.330e+02 8.340e+02 8.380e+02 8.410e+02 8.430e+02 8.480e+02
 8.550e+02 8.590e+02 8.600e+02 8.630e+02 8.670e+02 8.680e+02 8.690e+02
 8.730e+02 8.750e+02 8.810e+02 8.890e+02 8.910e+02 8.950e+02 8.970e+02
 8.980e+02 9.040e+02 9.050e+02 9.100e+02 9.110e+02 9.170e+02 9.240e+02
 9.260e+02 9.270e+02 9.310e+02 9.350e+02 9.360e+02 9.390e+02 9.400e+02
 9.430e+02 9.450e+02 9.520e+02 9.550e+02 9.580e+02 9.610e+02 9.660e+02
 9.670e+02 9.680e+02 9.780e+02 9.830e+02 9.910e+02 9.950e+02 9.960e+02
 9.990e+02 1.001e+03 1.002e+03 1.006e+03 1.008e+03 1.014e+03 1.015e+03
 1.017e+03 1.019e+03 1.023e+03 1.027e+03 1.030e+03 1.035e+03 1.036e+03
 1.039e+03 1.040e+03 1.046e+03 1.047e+03 1.048e+03 1.053e+03 1.054e+03
 1.070e+03 1.074e+03 1.077e+03 1.085e+03 1.088e+03 1.091e+03 1.094e+03
 1.096e+03 1.103e+03 1.106e+03 1.110e+03 1.112e+03 1.127e+03 1.129e+03
 1.131e+03 1.132e+03 1.135e+03 1.137e+03 1.150e+03 1.151e+03 1.152e+03
 1.154e+03 1.159e+03 1.160e+03 1.171e+03 1.178e+03 1.181e+03 1.182e+03
 1.185e+03 1.187e+03 1.189e+03 1.196e+03 1.202e+03 1.204e+03 1.209e+03
 1.210e+03 1.214e+03 1.216e+03 1.217e+03 1.219e+03 1.222e+03 1.225e+03
 1.227e+03 1.228e+03 1.236e+03 1.241e+03 1.257e+03 1.259e+03 1.265e+03
 1.271e+03 1.274e+03 1.279e+03 1.289e+03 1.294e+03 1.296e+03 1.297e+03
 1.298e+03 1.300e+03 1.302e+03 1.307e+03 1.311e+03 1.312e+03 1.313e+03
 1.318e+03 1.319e+03 1.320e+03 1.329e+03 1.340e+03 1.345e+03 1.347e+03
 1.348e+03 1.353e+03 1.354e+03 1.359e+03 1.363e+03 1.365e+03 1.369e+03
 1.371e+03 1.372e+03 1.382e+03 1.384e+03 1.387e+03 1.391e+03 1.393e+03
 1.400e+03 1.406e+03 1.412e+03 1.416e+03 1.419e+03 1.424e+03 1.430e+03
 1.433e+03 1.439e+03 1.441e+03 1.444e+03 1.447e+03 1.451e+03 1.457e+03
 1.459e+03 1.461e+03 1.463e+03 1.464e+03 1.465e+03 1.470e+03 1.474e+03
 1.478e+03 1.480e+03 1.482e+03 1.484e+03 1.485e+03 1.495e+03 1.496e+03
       nan]

NameError: name 'unif_freq' is not defined